Revit 2024 API
ElectricalAnalyticalNode.CanConnectToUpstreamNode Method
 Verifies that the current node can connect to the upstream node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public bool CanConnectToUpstreamNode(
	ElementId upstreamNodeId
)
Visual Basic
Public Function CanConnectToUpstreamNode ( _
	upstreamNodeId As ElementId _
) As Boolean
Visual C++
public:
bool CanConnectToUpstreamNode(
	ElementId^ upstreamNodeId
)
Parameters
upstreamNodeId
Type: Autodesk.Revit.DB.ElementId
 The upstream node id.
Return Value
 True if the current node can connect to the upstream node.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace